## How do I rename columns in a pandas DataFrame?

In [1]:
import pandas as pd
import ssl

In [3]:
ssl._create_default_https_context = ssl._create_unverified_context

In [4]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [6]:
# if I don't want space in the name of 'Colors Reported'
ufo.rename(columns = {'Colors Reported':'Colors_Reported', 'Shape Reported': 'Shape_Reported'}, inplace=True)

In [7]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

Another method

In [8]:
ufo_cols = ['city', 'colors_reported', 'shape_reported', 'state', 'time']

In [9]:
ufo.columns = ufo_cols

In [10]:
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [12]:
ufo.shape_reported.head()

0    TRIANGLE
1       OTHER
2        OVAL
3        DISK
4       LIGHT
Name: shape_reported, dtype: object

Another approach to assign alternative names to the columns

In [15]:
ufo_cols = ['city name', 'colors reported', 'shape reported', 'state name', 'time']

In [16]:
# if no names are passed the behavior is identical to header=0
ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)
ufo.head()

,city name,colors reported,shape reported,state name,time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

Imagine you have a DataFrame with 100 columns, and you need to replace the spaces in the column
names with underscores(_)

In [17]:
ufo.columns = ufo.columns.str.replace(' ', '_')
ufo.columns

Index(['city_name', 'colors_reported', 'shape_reported', 'state_name', 'time'], dtype='object')

In [18]:
ufo.head()

,city_name,colors_reported,shape_reported,state_name,time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00